chipKIT32/chipKIT-core/pic32/cores/pic32/harmony/framework/peripheral/usb/processor/usb_p32mx440f256h.h
PLIB_INLINE SFR_DATA _USB_BUSY_WITH_TOKEN_LEN(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1CON_PKTDIS_TOKBUSY_LENGTH;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _USB_GENERATE_RESET_LEN(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1CON_USBRST_LENGTH;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _USB_HOST_ENABLE_LEN(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1CON_HOSTEN_LENGTH;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _USB_RESUME_SIGNALING_ON_LEN(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1CON_RESUME_LENGTH;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _USB_FREEZE_BUFFERS_LEN(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1CON_PPBRST_LENGTH;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _USB_DEVICE_ENABLE_LEN(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1CON_USBEN_SOFEN_LENGTH;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _USB_START_OF_FRAMES_ON_LEN(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1CON_USBEN_SOFEN_LENGTH;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _USB_NEXT_TOKEN_LOWSPEED_LEN(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1ADDR_LSPDEN_LENGTH;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _USB_DEVICE_ADDRESS_LEN(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1ADDR_DEVADDR_LENGTH;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _USB_FRAME_NUMBER_7to0_LEN(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1FRML_FRML_LENGTH;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _USB_FRAME_NUMBER_10to8_LEN(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1FRMH_FRMH_LENGTH;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _USB_TOKEN_PID_LEN(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1TOK_PID_LENGTH;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _USB_TOKEN_ENDPOINT_LEN(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1TOK_EP_LENGTH;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _USB_SOF_COUNT_LEN(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1SOF_CNT_LENGTH;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _USB_BDT_BASE_ADDR_15to09_LEN(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1BDTP1_BDTPTRL_LENGTH;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _USB_BDT_BASE_ADDR_23to16_LEN(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1BDTP2_BDTPTRH_LENGTH;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _USB_BDT_BASE_ADDR_31to24_LEN(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1BDTP3_BDTPTRU_LENGTH;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _USB_EYE_PATTERN_ON_LEN(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1CNFG1_UTEYE_LENGTH;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _USB_STOP_IN_IDLE_LEN(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1CNFG1_USBSIDL_LENGTH;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _USB_EP0_LOW_SPEED_CONNECT_ON_LEN(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1EP0_LSPD_LENGTH;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _USB_EP0_NO_RETRY_NAKS_LEN(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1EP0_RETRYDIS_LENGTH;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _USB_EP0_CONTROL_OFF_LEN(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1EP0_EPCONDIS_LENGTH;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _USB_EP0_RCV_ON_LEN(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1EP0_EPRXEN_LENGTH;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _USB_EP0_XMIT_ON_LEN(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1EP0_EPTXEN_LENGTH;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _USB_EP0_XMIT_ON_EN_LEN(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1EP0_EPTXEN_LENGTH;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _USB_EP0_STALL_ON_LEN(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1EP0_EPSTALL_LENGTH;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _USB_EP0_HANDSHAKE_ON_LEN(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1EP0_EPHSHK_LENGTH;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _USB_EP1_CONTROL_OFF_LEN(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1EP1_EPCONDIS_LENGTH;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _USB_EP1_RCV_ON_LEN(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1EP1_EPRXEN_LENGTH;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

