chipKIT32/chipKIT-core/pic32/cores/pic32/harmony/framework/peripheral/usb/processor/usb_p32mx440f256h.h
PLIB_INLINE SFR_DATA _USB_EP1_XMIT_ON_LEN(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1EP1_EPTXEN_LENGTH;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _USB_EP1_STALL_ON_LEN(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1EP1_EPSTALL_LENGTH;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _USB_EP1_HANDSHAKE_ON_LEN(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1EP1_EPHSHK_LENGTH;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _USB_EP2_CONTROL_OFF_LEN(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1EP2_EPCONDIS_LENGTH;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _USB_EP2_RCV_ON_LEN(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1EP2_EPRXEN_LENGTH;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _USB_EP2_XMIT_ON_LEN(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1EP2_EPTXEN_LENGTH;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _USB_EP2_STALL_ON_LEN(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1EP2_EPSTALL_LENGTH;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _USB_EP2_HANDSHAKE_ON_LEN(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1EP2_EPHSHK_LENGTH;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _USB_EP3_CONTROL_OFF_LEN(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1EP3_EPCONDIS_LENGTH;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _USB_EP3_RCV_ON_LEN(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1EP3_EPRXEN_LENGTH;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _USB_EP3_XMIT_ON_LEN(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1EP3_EPTXEN_LENGTH;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _USB_EP3_STALL_ON_LEN(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1EP3_EPSTALL_LENGTH;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _USB_EP3_HANDSHAKE_ON_LEN(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1EP3_EPHSHK_LENGTH;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _USB_EP4_CONTROL_OFF_LEN(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1EP4_EPCONDIS_LENGTH;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _USB_EP4_RCV_ON_LEN(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1EP4_EPRXEN_LENGTH;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _USB_EP4_XMIT_ON_LEN(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1EP4_EPTXEN_LENGTH;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _USB_EP4_STALL_ON_LEN(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1EP4_EPSTALL_LENGTH;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _USB_EP4_HANDSHAKE_ON_LEN(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1EP4_EPHSHK_LENGTH;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _USB_EP5_CONTROL_OFF_LEN(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1EP5_EPCONDIS_LENGTH;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _USB_EP5_RCV_ON_LEN(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1EP5_EPRXEN_LENGTH;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _USB_EP5_XMIT_ON_LEN(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1EP5_EPTXEN_LENGTH;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _USB_EP5_STALL_ON_LEN(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1EP5_EPSTALL_LENGTH;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _USB_EP5_HANDSHAKE_ON_LEN(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1EP5_EPHSHK_LENGTH;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _USB_EP6_CONTROL_OFF_LEN(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1EP6_EPCONDIS_LENGTH;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

PLIB_INLINE SFR_DATA _USB_EP6_RCV_ON_LEN(USB_MODULE_ID i)
{
    switch (i) {
        case USB_ID_1 :
            return _U1EP6_EPRXEN_LENGTH;
        case USB_NUMBER_OF_MODULES :
        default :
            return (SFR_DATA)-1;
    }
}

